Repository: ATIX-AG/foreman_remote_execution
Catalog: locale/*/foreman_remote_execution.po
Languages: ru

source: Another interface is already set as execution. Are you sure you want to use this one instead?
ru: Для удаленного выполнения уже выбран другой интерфейс. Вы действительно хотите его заменить?

source: There was an error while updating the status, try refreshing the page.
ru: Во время обновления статуса произошла ошибка. Попробуйте обновить страницу.

source: List foreign input sets
ru: Показать внешние наборы входных параметров

source: Show foreign input set details
ru: Показать информацию о внешнем наборе входных параметров

source: Target template ID
ru: Идентификатор подключаемого шаблона

source: Include all inputs form the foreign template
ru: Добавить все входные параметры из внешнего шаблона

source: A comma separated list of input names to be included from the foreign template.
ru: Список входных параметров, которые должны быть включены при импорте другого шаблона.

source: Input set description
ru: Описание набора входных параметров

source: Create a foreign input set
ru: Создать набор входных параметров

source: Delete a foreign input set
ru: Удалить набор входных параметров

source: Update a foreign input set
ru: Обновить набор входных параметров

source: List job invocations
ru: Список вызовов заданий

source: Show job invocation
ru: Показать вызов задания

source: The job template to use
ru: Шаблон для использования

source: Invocation type, one of %s
ru: Тип вызова. Возможные значения: %s

source: Inputs to use
ru: Входящие параметры

source: SSH provider specific options
ru: Параметры провайдера SSH

source: What user should be used to run the script (using sudo-like mechanisms). Defaults to a template parameter or global setting.
ru: Пользователь, от имени которого будет запускаться сценарий (по принципу sudo). По умолчанию определяется параметрами шаблона или глобальными параметрами.

source: Create a recurring job
ru: Создать повторяющееся задание

source: How often the job should occur, in the cron format
ru: Частота выполнения задания, в формате cron

source: Repeat a maximum of N times
ru: Количество повторений

source: Perform no more executions after this time
ru: Остановить после указанного числа повторений

source: Schedule the job to start at a later time
ru: Отложить выполнение задания

source: Schedule the job for a future time
ru: Настроить время запуска

source: Indicates that the action should be cancelled if it cannot be started before this time.
ru: Обозначает, что действие следует отменить, если оно не будет запущено до указанного времени.

source: Control concurrency level and distribution over time
ru: Контроль параллельного выполнения и распределения во времени

source: Distribute tasks over N seconds
ru: Распределить задачи в пределах заданного периода времени (в секундах)

source: Run at most N tasks at a time
ru: Максимальное количество параллельно выполняемых задач

source: Override the description format from the template for this invocation only
ru: Переопределить формат описания из шаблона только на время этого вызова

source: Create a job invocation
ru: Создать вызов задания

source: Get output for a host
ru: Получить данные вывода узла

source: Host with id '%{id}' was not found
ru: Узел «%{id}» не найден.

source: Template with id '%{id}' was not found
ru: Шаблон «%{id}» не найден.

source: List job templates
ru: Список шаблонов заданий

source: List job templates per location
ru: Список шаблонов заданий по местоположению

source: List job templates per organization
ru: Список шаблонов заданий по организациям

source: Show job template details
ru: Показать информацию о шаблоне

source: Template name
ru: Имя шаблона

source: Job category
ru: Категория

source: This template is used to generate the description. Input values can be used using the syntax %{package}. You may also include the job category and template name using %{job_category} and %{template_name}.
ru: Это шаблон для генерации описания. Для того чтобы добавить переменную, используйте синтаксис %{package}; категорию задания — %{job_category}; название шаблона — %{template_name}.

source: Provider type
ru: Тип провайдера

source: Whether or not the template is locked for editing
ru: Сообщает о блокировании шаблона для редактирования

source: Effective user options
ru: Параметры действующего пользователя

source: What user should be used to run the script (using sudo-like mechanisms)
ru: Пользователь, от имени которого будет запускаться сценарий (по принципу sudo)

source: Whether it should be allowed to override the effective user from the invocation form.
ru: Разрешает переопределение действующего пользователя из формы вызова.

source: Whether the current user login should be used as the effective user
ru: Разрешает текущему пользователю выступать в роли действующего пользователя

source: Create a job template
ru: Создать шаблон задания

source: Update a job template
ru: Обновить шаблон задания

source: Template version
ru: Версия шаблона

source: Delete a job template
ru: Удалить шаблон задания

source: Clone a provision template
ru: Клонировать шаблон подготовки

source: List remote execution features
ru: Список функций удаленного выполнения

source: Show remote execution feature
ru: Показать функцию удаленного выполнения

source: Job template ID to be used for the feature
ru: Идентификатор шаблона задания для этой функции

source: List template inputs
ru: Показать параметры ввода

source: Show template input details
ru: Показать информацию о параметрах ввода

source: Input name
ru: Имя параметра

source: Input description
ru: Описание параметра

source: Input is required
ru: Обязательный параметр

source: Input is advanced
ru: Расширенный параметр

source: Input type
ru: Тип ввода

source: Fact name, used when input type is fact
ru: Имя факта (используется, если поле «Тип ввода» содержит «Значение факта»)

source: Variable name, used when input type is variable
ru: Имя переменной (используется, если поле «Тип ввода» содержит «Переменная»)

source: Puppet class name, used when input type is puppet_parameter
ru: Имя класса Puppet (используется, если поле «Тип ввода» содержит «Параметр Puppet»)

source: Puppet parameter name, used when input type is puppet_parameter
ru: Имя параметра Puppet (используется, если поле «Тип ввода» содержит «Параметр Puppet»)

source: Selectable values for user inputs
ru: Список возможных значений

source: Create a template input
ru: Создать входной параметр

source: Delete a template input
ru: Удалить входной параметр

source: Update a template input
ru: Обновить входной параметр

source: Problem with previewing the template: %{error}. Note that you must save template input changes before you try to preview it.
ru: Не удалось открыть шаблон для предварительного просмотра: %{error}. Прежде чем повторить попытку, сохраните изменения входных параметров.

source: Run Job
ru: Выполнить задание

source: Run
ru: Выполнить

source: Success
ru: Успешно

source: Failed
ru: Не удалась

source: Pending
ru: Ожидание

source: Cancelled
ru: Отменено

source: queued
ru: в очереди

source: running %{percent}%
ru: выполнение %{percent}%

source: succeeded
ru: завершено

source: failed
ru: ошибка

source: unknown status
ru: неизвестный статус

source: cancelled
ru: отменено

source: success
ru: успешно

source: pending
ru: ожидание

source: Host detail
ru: Свойства узла

source: Rerun on %s
ru: Повторить на %s

source: N/A
ru: Недоступно

source: Refresh this page
ru: Обновить страницу

source: Refresh
ru: Обновить

source: Rerun
ru: Повторить

source: Rerun the job
ru: Повторно выполнить задание

source: Rerun failed
ru: Повторить неудавшиеся

source: Rerun on failed hosts
ru: Повторить на узлах с ошибками

source: Job Task
ru: Задача

source: See the last task details
ru: Показать последнюю выполненную задачу

source: Cancel Job
ru: Отменить

source: Try to cancel the job
ru: Попытаться отменить задание

source: Task Details
ru: Описание задачи

source: See the task details
ru: Просмотр подробной информации о задаче

source: Try to cancel the job on a host
ru: Попытаться отменить задание на узле

source: %s ago
ru: %s назад

source: in %s
ru: в %s

source: Documentation
ru: Документация

source: Template input
ru: Параметр вввода

source: remove template input
ru: удалить параметр ввода

source: Use default description template
ru: Использовать стандартный шаблон

source: Description template
ru: Шаблон описания

source: Explanation
ru: Объяснение

source: This template is used to generate the description Input values can be used using the syntax %{package}. You may also include the job category and template name using %{job_category} and %{template_name}.
ru: Это шаблон для генерации описания. Для того чтобы добавить переменную, используйте синтаксис %{package}; категорию задания — %{job_category}; название шаблона — %{template_name}.

source: Could not use any template used in the job invocation
ru: Не удалось применить ни один из шаблонов, настроенных для этого вызова задания

source: The only applicable proxy %{proxy_names} is down
ru: Единственный доступный прокси, %{proxy_names}, выключен

source: Could not use any proxy. Consider configuring %{global_proxy} or %{fallback_proxy} in settings
ru: Не удалось связаться с прокси. Попробуйте настроить %{global_proxy} или %{fallback_proxy}

source: Failed rendering template: %s
ru: Не удалось обработать шаблон: %s

source: Failed to initialize command
ru: Не удалось инициализировать команду

source: %{description} on %{host}
ru: %{description} на %{host}

source: Remote action:
ru: Удаленное действие:

source: User can not execute job on host %s
ru: Пользователь не может запустить задание на %s

source: User can not execute this job template
ru: Пользователь не может запустить этот шаблон задания

source: User can not execute this job template on %s
ru: Пользователь не может запустить этот шаблон задания на %s

source: Script execution failed
ru: Не удалось выполнить сценарий

source: Initialization error: %s
ru: Ошибка инициализации: %s

source: Error loading data from proxy
ru: Не удалось загрузить данные с прокси

source: No output
ru: Нет вывода

source: Exit status: %s
ru: Код завершения: %s

source: Job finished with error
ru: Задание было завершено с ошибкой

source: Unable to fetch public key
ru: Не удалось получить открытый ключ

source: host already has an execution interface
ru: для этого узла уже настроен интерфейс выполнения

source: Circular dependency detected in foreign input set '%{template}' -> '%{target_template}'. Templates stack: %{templates_stack}
ru: При добавлении входных параметров из «%{template}» в «%{target_template}» была обнаружена циклическая зависимость. Стек: %{templates_stack}

source: Execution
ru: Выполнение

source: Last execution succeeded
ru: Выполнено успешно

source: No execution finished yet
ru: Ни один цикл выполнения не завершился

source: Last execution failed
ru: Ошибка выполнения

source: Unknown execution status
ru: Статус выполнения неизвестен

source: Recursive rendering of templates detected
ru: Обнаружена рекурсия при обработке шаблонов

source: error during rendering: %s
ru: ошибка при обработке шаблонов: %s

source: input macro with name '%s' used, but no input with such name defined for this template
ru: ожидается макрос «%s», но входных параметров с таким именем для этого шаблона не обнаружено

source: included template '%s' not found
ru: связанный шаблон «%s» не найден

source: template
ru: шаблон

source: Cannot specify both bookmark_id and search_query
ru: bookmark_id и search_query не могут использоваться одновременно.

source: Cannot specify both recurrence and scheduling
ru: Вы не можете выбрать произвольное время запуска, одновременно настроив многократное выполнение.

source: Unknown input %{input_name} for template %{template_name}
ru: Неизвестный ввод данных из шаблона %{template_name}: %{input_name}

source: Feature input %{input_name} not defined in template %{template_name}
ru: Входной параметр %{input_name}, заданный функцией, не определен в шаблоне %{template_name}.

source: No template mapped to feature %{feature_name}
ru: С %{feature_name} не связан ни один шаблон.

source: The template %{template_name} mapped to feature %{feature_name} is not accessible by the user
ru: У этого пользователя нет доступа к шаблону %{template_name}, связанному с %{feature_name}

source: Job Invocation
ru: Вызов задания

source: Duplicated inputs detected: %{duplicated_inputs}
ru: Обнаружены дубликаты входных данных: %{duplicated_inputs}

source: This template is locked. Please clone it to a new template to customize.
ru: Шаблон заблокирован. Скопируйте его для создания нового шаблона на его основе.

source: Unknown remote execution feature %s
ru: Неизвестная функция удаленного выполнения: %s

source: Search the host for any proxy with Remote Execution, useful when the host has no subnet or the subnet does not have an execution proxy
ru: Искать любые прокси с возможностью удаленного запуска заданий для этого узла. Используется, если для узла не настроена подсеть или в подсети не настроен прокси-сервер.

source: Search for remote execution proxy outside of the proxies assigned to the host. If locations or organizations are enabled, the search will be limited to the host's organization or location.
ru: Искать прокси с возможностью удаленного запуска заданий за пределами серверов для этого узла. Если были настроены местоположения и организации, поиск будет ограничен местоположением данного узла и организацией, которой он принадлежит.

source: Default user to use for SSH. You may override per host by setting a parameter called remote_execution_ssh_user.
ru: Пользователь по умолчанию для SSH. Для того чтобы переопределить это значение для отдельных узлов, используйте параметр remote_execution_ssh_user.

source: Default user to use for executing the script. If the user differs from the SSH user, su or sudo is used to switch the user.
ru: Пользователь, от имени которого по умолчанию будет запускаться сценарий. Если отличается от пользователя SSH, для делегирования прав будет использоваться su или sudo.

source: What command should be used to switch to the effective user. One of %s
ru: Команда для переключения в режим действующего пользователя. Возможные варианты: %s

source: Whether we should sync templates from disk when running db:seed.
ru: Разрешает синхронизацию шаблонов с диска во время выполнения db:seed.

source: Effective user method "%{current_value}" is not one of %{valid_methods}
ru: Метод действующего пользователя, «%{current_value}», не является одним из допустимых вариантов: %{valid_methods}

source: Dynamic Query
ru: Динамический

source: Static Query
ru: Статический

source: Cannot resolve hosts without a user
ru: Невозможно сформировать список узлов, не выбрав пользователя.

source: Cannot resolve hosts without a bookmark or search query
ru: Невозможно сформировать список узлов, не выбрав закладку или не указав запрос поиска

source: Must select a bookmark or enter a search query
ru: Выберите закладку или введите запрос поиска

source: User input
ru: Ввод пользователя

source: Variable
ru: Переменная

source: Fact value
ru: Значение факта

source: Puppet parameter
ru: Параметр Puppet

source: Value for required input '%s' was not specified
ru: Входные данные «%s» не определены.

source: Input
ru: Параметр

source: Not all required inputs have values. Missing inputs: %s
ru: Отсутствуют значения некоторых обязательных входных данных: %s

source: Description
ru: Описание

source: Job template
ru: Шаблон задания

source: Resolves to
ru: Применимо к

source: hosts
ru: узлу(ам)

source: Preview
ru: Предварительный просмотр

source: Hide advanced fields
ru: Скрыть дополнительные параметры

source: Display advanced fields
ru: Показать дополнительные параметры

source: A user to be used for executing the script. If it differs from the SSH user, su or sudo is used to switch the accounts.
ru: Пользователь, от имени которого должен запускаться сценарий. Если отличается от пользователя SSH, для делегирования прав будет использоваться su или sudo.

source: Effective user
ru: Действующий пользователь

source: Concurrency level
ru: Параллелизм

source: Distribute execution over N seconds
ru: Распределить выполнение на протяжении заданного периода времени (в секундах)

source: Time span
ru: Интервал

source: Type of query
ru: Тип запроса

source: Type has impact on when is the query evaulated to hosts.<br><ul><li><b>Static</b> - evaluates just after you submit this form</li><li><b>Dynamic</b> - evaluates just before the execution is started, so if it's planed in future, targeted hosts set may change before it</li></ul>
ru: Тип определяет, в какое время будет обработан созданный запрос.<br><ul><li><b>Статический</b> запрос обрабатывается сразу после сохранения этой формы.</li><li><b>Динамический</b> запрос обрабатывается непосредственно перед запуском задания, поэтому в случае с отложенными заданиями не исключено, что за время ожидания запуска список узлов может измениться.</li></ul>

source: The final host list may change because the selected query is dynamic. It will be rerun during execution.
ru: Окончательный список узлов может измениться, так как динамический запрос обрабатывается непосредственно во время запуска задания.

source: ...and %{count} more
ru: ...и еще %{count}

source: No hosts found.
ru: Нет узлов.

source: Close
ru: Закрыть

source: Filter
ru: Фильтр

source: Search
ru: Поиск

source: Host
ru: Хост

source: Status
ru: Статус

source: Actions
ru: Действия

source: The dynamic query '%{query}' was not resolved yet. The list of hosts to which it would resolve now can be seen %{here}.
ru: Динамический запрос «%{query}» еще не был обработан. Список узлов, к которым он будет применен, можно проверить %{here}.

source: here
ru: здесь

source: Target hosts
ru: Узлы

source: Bookmark
ru: Закладка

source: Manual selection
ru: Ручной выбор

source: Evaluated at:
ru: Обработано:

source: Total hosts
ru: Всего узлов

source: Providers and templates
ru: Провайдеры и шаблоны

source: Preview for target %s
ru: Предварительный просмотр для узла %s

source: following user inputs were provided
ru: Ввод пользователя:

source: Job invocations
ru: Вызовы заданий

source: Succeeded
ru: Завершено

source: Start
ru: Начало

source: Job invocation
ru: Вызов задания

source: Overview
ru: Обзор

source: Hosts
ru: Узлы

source: Recurring logic
ru: Регулярное выполнение

source: Job
ru: Задание

source: Type
ru: Тип

source: Add Input
ru: Добавить параметр

source: add a input for this template
ru: Добавить входные параметры

source: Add Foreign Input Set
ru: Добавить шаблон

source: add an input set for this template to reference a different template inputs
ru: Добавить набор входных параметров из другого шаблона

source: Snippet
ru: Фрагмент

source: Edit Job Template
ru: Изменить шаблон задания

source: Job Templates
ru: Шаблоны заданий

source: New Job Template
ru: Создать шаблон задания

source: JobTemplate|Name
ru: Имя

source: JobTemplate|Snippet
ru: Фрагмент

source: JobTemplate|Locked
ru: Заблокирован

source: This template is locked for editing.
ru: Шаблон заблокирован.

source: The execution interface is used for remote execution
ru: Интерфейс выполнения используется для удаленного исполнения заданий

source: Remote execution
ru: Удаленное выполнение

source: Remote Execution
ru: Удаленное выполнение

source: Proxies
ru: Прокси

source: Select as many remote execution proxies as applicable for this subnet. When multiple proxies with the same provider are added, actions will be load balanced among them.
ru: Выберите все возможные удаленные прокси для этой подсети. Добавление нескольких прокси для одного провайдера позволит равномерно распределять действия между ними.

source: You are not allowed to see the currently assigned template. Saving the form now would unassign the template.
ru: У вас нет доступа к используемому шаблону. При сохранении формы он будет автоматически отключен.

source: Remote Execution Features
ru: Функции удаленного выполнения

source: Label
ru: Метка

source: Name
ru: Название

source: Edit Remote Execution Feature
ru: Изменить функцию удаленного выполнения

source: Foreign input set
ru: Импорт входных данных

source: remove template input set
ru: удалить набор входных данных шаблона

source: A comma separated list of input names to be excluded from the foreign template.
ru: Список входных параметров, которые должны быть исключены при импорте другого шаблона.

source: A list of options the user can select from. If not provided, the user will be given a free-form field
ru: Список доступных пользователю параметров. Если не определен, пользователю будет предложено ввести параметры в свободной форме.

source: Detail of %s run
ru: Сведения о выполнении %s

source: Back to Job
ru: Назад к заданию

source: Toggle command
ru: Показать команды

source: Toggle STDERR
ru: Показать STDERR

source: Toggle STDOUT
ru: Показать STDOUT

source: Toggle DEBUG
ru: Показать DEBUG

source: Target:
ru: Узел:

source: Scroll to bottom
ru: Перейти вниз

source: Scroll to top
ru: Перейти наверх

source: Unsupported or no operating system found for this host.
ru: Не поддерживается, или операционная система узла не обнаружена.

source: Job templates
ru: Шаблоны заданий

source: Jobs
ru: Задания

source: Import Puppet classes
ru: Импорт классов Puppet

source: Import facts
ru: Импорт фактов

source: Update architecture
ru: Обновить архитектуру

source: Delete architecture
ru: Удалить архитектуру

source: Create architecture
ru: Создать архитектуру

source: Action with sub plans
ru: Действия с подпланами

source: A plugin bringing remote execution to the Foreman, completing the config management functionality with remote management functionality.
ru: Дополнительный модуль Foreman для удаленного выполнения заданий, объединяющий функции управления конфигурацией и удаленного контроля.
